In [238]:
import pandas as pd

In [116]:

data = pd.DataFrame ({
    
    #nome colonne
    "Marca": ["Iphone","Google","Samsung","Oppo","Sony","POCO"],
    #colonna modello
    "Modello": ["12 PRO MAX","Pixel 5", "Galaxy S20 FE","Reno 4 SE","Xperia 5 II","X3"],
    
    
    #colonna mpx fotocamera
    "Mpx_fotocamera": [12,
             12,12,48,12,64],
    
    
    #colonna numero di cores
    "N. Core": [6,
             8,8,8,8,8],
    
    #grandezza display
    "Dim. Display": [6.7, 6, 6.5, 6.4, 6.1, 6.7]
})

___Allineamento___

In [112]:
data = data.style.set_properties(**{'text-align': 'center'})
#allineamento ricorda che i drop non vanno se eseguito l'allineamento

In [117]:
data

     Marca        Modello  Mpx_fotocamera  N. Core  Dim. Display
0   Iphone     12 PRO MAX              12        6           6.7
1   Google        Pixel 5              12        8           6.0
2  Samsung  Galaxy S20 FE              12        8           6.5
3     Oppo      Reno 4 SE              48        8           6.4
4     Sony    Xperia 5 II              12        8           6.1
5     POCO             X3              64        8           6.7

___Data Drop___

In [106]:
data ["Marca"]

0     Iphone
1     Google
2    Samsung
3       Oppo
4       Sony
5       POCO
Name: Marca, dtype: object

In [107]:
data.drop(["Marca"], axis=1)
#no marca

         Modello  Mpx_fotocamera  N. Core  Dim. Display
0     12 PRO MAX              12        6           6.7
1        Pixel 5              12        8           6.0
2  Galaxy S20 FE              12        8           6.5
3      Reno 4 SE              48        8           6.4
4    Xperia 5 II              12        8           6.1
5             X3              64        8           6.7

In [108]:
data.drop([0], axis=0)
#no iphone

     Marca        Modello  Mpx_fotocamera  N. Core  Dim. Display
1   Google        Pixel 5              12        8           6.0
2  Samsung  Galaxy S20 FE              12        8           6.5
3     Oppo      Reno 4 SE              48        8           6.4
4     Sony    Xperia 5 II              12        8           6.1
5     POCO             X3              64        8           6.7

___Data.Describe___

In [109]:
data.describe

<bound method NDFrame.describe of      Marca        Modello  Mpx_fotocamera  N. Core  Dim. Display
0   Iphone     12 PRO MAX              12        6           6.7
1   Google        Pixel 5              12        8           6.0
2  Samsung  Galaxy S20 FE              12        8           6.5
3     Oppo      Reno 4 SE              48        8           6.4
4     Sony    Xperia 5 II              12        8           6.1
5     POCO             X3              64        8           6.7>

___Data.iloc:___


Per identificare una riga all'interno della tabella

In [120]:
#1st row
sel = data.iloc [0]
print ("Row ad index 0")
print (sel)
print (type(sel))
print()

#2nd row
sel = data.iloc [1]
print ("Row ad index 1")
print (data.iloc[1])
print()

#3rd row
#2nd row
sel = data.iloc [2]
print ("Row ad index 3")
print (data.iloc[2])
print()

Row ad index 0
Marca                 Iphone
Modello           12 PRO MAX
Mpx_fotocamera            12
N. Core                    6
Dim. Display             6.7
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

Row ad index 1
Marca              Google
Modello           Pixel 5
Mpx_fotocamera         12
N. Core                 8
Dim. Display            6
Name: 1, dtype: object

Row ad index 3
Marca                   Samsung
Modello           Galaxy S20 FE
Mpx_fotocamera               12
N. Core                       8
Dim. Display                6.5
Name: 2, dtype: object

___Data.shape___

Ritorna una tupla che rappresenta la dimensione del DataFrame(n° di righe e colonne)

In [131]:
print(data.shape)
print()
print(data.iloc[data.shape[0]-1])
print ("\nultima riga:\n")
print (data.iloc[-1])
print ("\nnumero di righe:",data.shape[0])
#Qui iloc viene aggiunto a datashape

(6, 5)

Marca             POCO
Modello             X3
Mpx_fotocamera      64
N. Core              8
Dim. Display       6.7
Name: 5, dtype: object

ultima riga:

Marca             POCO
Modello             X3
Mpx_fotocamera      64
N. Core              8
Dim. Display       6.7
Name: 5, dtype: object

numero di righe: 6

In [133]:
#all expanded
dimensions = data.shape
number_of_rows = dimensions[0]
last_index = number_of_rows - 1
last_row = data.iloc[last_index]
print (last_row)

Marca             POCO
Modello             X3
Mpx_fotocamera      64
N. Core              8
Dim. Display       6.7
Name: 5, dtype: object

In [135]:
#rows with indexes in interval (1,3)
print(data.iloc [1:3])

     Marca        Modello  Mpx_fotocamera  N. Core  Dim. Display
1   Google        Pixel 5              12        8           6.0
2  Samsung  Galaxy S20 FE              12        8           6.5

In [136]:
#rows with indexes specified in an array
print(
    data.iloc[[0,2,4]]

)

     Marca        Modello  Mpx_fotocamera  N. Core  Dim. Display
0   Iphone     12 PRO MAX              12        6           6.7
2  Samsung  Galaxy S20 FE              12        8           6.5
4     Sony    Xperia 5 II              12        8           6.1

In [141]:
#select row and column
data.iloc [2,3]

8

In [140]:
data.iloc [2,-1]

6.5

___Caricamento___ di un csv in pandas

In [147]:
titanic = pd.read_csv("../../titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [149]:
#select a series
#Nota non tutti i dati sono omogenei come ci si aspetta e non sono visualizzabili 
#tutte le righe
titanic ["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [150]:
# come viene interpretata ogni colonna
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [154]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [174]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [164]:
#analisi colonna age
print(titanic["Age"].unique())
print("\nProprietà size del risultato sopra, ovvero il numero dei valori unici pari a :",titanic["Age"].unique().size)

[22.   38.   26.   35.     nan 54.    2.   27.   14.    4.   58.   20.
 39.   55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.
 18.    3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.
 16.   25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.
 14.5  70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.
 56.   50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.
 60.   10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.
  0.67 30.5   0.42 34.5  74.  ]

Proprietà size del risultato sopra, ovvero il numero dei valori unici pari a : 89

In [199]:
# ordinare i risultati
ages = titanic ["Age"].unique()
ages.sort()
# prova per contare gli elementi
count = sum(1 for item in ages)
print(ages)
print ("\nIl numero degli elementi è : ",count)

[ 0.42  0.67  0.75  0.83  0.92  1.    2.    3.    4.    5.    6.    7.
  8.    9.   10.   11.   12.   13.   14.   14.5  15.   16.   17.   18.
 19.   20.   20.5  21.   22.   23.   23.5  24.   24.5  25.   26.   27.
 28.   28.5  29.   30.   30.5  31.   32.   32.5  33.   34.   34.5  35.
 36.   36.5  37.   38.   39.   40.   40.5  41.   42.   43.   44.   45.
 45.5  46.   47.   48.   49.   50.   51.   52.   53.   54.   55.   55.5
 56.   57.   58.   59.   60.   61.   62.   63.   64.   65.   66.   70.
 70.5  71.   74.   80.     nan]

Il numero degli elementi è :  89

In [186]:
print(ages.sort())

None

In [234]:
# Selection based on predicate
firstclass = titanic [titanic["Pclass"]==1]
firstclass

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [267]:
firstclass = firstclass [firstclass["Pclass"]!= 1]
firstclass

KeyError: 'Pclass'

In [250]:
#ordinare il daframe per un valore
firstclass.sort_values("Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
445,446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S
...,...,...,...,...,...,...,...,...,...,...,...,...
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C